<?php

/*
    ORM (Object-Relational Mapping) - технология программирования, которая обеспечивает работу с базой данных без необходимости писать SQL-код. ORM избавляет от необходимости писать однотипные примитивные SQL запросы.

    То есть есть класс сущность, который представляет собой одну запись в таблице. На основе класса создаётся объект и кладём в бд.
*/

/*
    Плюсы: скорость разработки

    Минусы: скорость работы
    
    Полное сравнение в этой статье - https://habrahabr.ru/company/pgdayrussia/blog/328690/
*/